#################################################
# rem Остановка службы сервера предприятия 1С x64
#################################################
net stop "1C:Enterprise 8.3 Server Agent (x86-64)"

#######################################################################################
# rem Принудительное завершение процессов сервера 1С, если они не завершились корректно
#######################################################################################
TASKKIll /F /FI "IMAGENAME eq rphost*"
TASKKIll /F /FI "IMAGENAME eq rmngr*"
TASKKIll /F /FI "IMAGENAME eq ragent*"

############################################################
# rem Удаление пользовательского кэша 1С (при необходимости)
############################################################
@FOR /D %%i in ("C:\Users\*") do (
@FOR /D %%j in ("%%i\Local settings\Application data\1C\1Cv8\????????-????-????-????-????????????") do rd /s /q "%%j"
@FOR /D %%j in ("%%i\AppData\Roaming\1C\1Cv8\????????-????-????-????-????????????") do rd /s /q "%%j"
)

###################################################
# rem Удаление сеансовых данных сервера предприятия
###################################################
for /d %%a in ("c:\Program Files\1cv8\srvinfo\reg_1541\snccntx*") do rd /s /q "%%a"

##################################
# rem Запуск службы сервера 1С x64
##################################
net start "1C:Enterprise 8.3 Server Agent (x86-64)"